using System;
using System.Collections.Generic;
using System.Linq;

namespace _01.WordsCount
{
    class Program
    {
        static void Main(string[] args)
        {
            // find how many occurences of each word in a text
            Dictionary<string, int> numbersDict = new Dictionary<string, int>();
            string input = @"Проточиха се студените декемврийски нощи. Наваля нов сняг и сега небето се е изяснило като гледжосана паница с нарисувани по нея звезди и един виторог месец, също като тоя, който се е наклонил до самия комин на съседната къща.

Виторогият месец и коминът си говорят нещо смешно. Аз виждам много добре от моето прозорче и се усмихвам. Може би греша, като ви говоря за нелепиците на детското си въображение?

Трудно е да се разпръснат привиденията на зимната нощ, която се е надвесила над затрупаното под снега село и се е проснала като океан със звездите си и с месеца си. Океан ли казах? Сестра ми, сладкодумницата, сравнява по-сполучливо. Тя казва, че звездите приличали на цъфнали минзухари, които беряхме пролет на поляната зад старата дъбрава. Сравнението е хубаво. И по-хубаво не може да се измисли… Продължавам да гледам звездите.

Виждали ли сте декемврийските звезди? Малките декемврийски звезди? Обичах да ги гледам и да ги слушам. Струваше ми се, че звънят като ледени шушулки над схлупената ни стряха и ни веселят, когато ни е тъжно. Те бяха звезди жълти, сини, морави и червени като разкаленото желязо в нашата селска ковачница.

Стана дума за ковачницата — за искрите, които хвърчат из задимената работилничка и за белия огън под духалото, който прилича на слънцето и ни ослепява, колчем го погледнем. И мислите ми се понасят и трептят към задимения покрив на старата ковачница.

Много неща могат да разпалят въображението на селското момче, което не иска още да спи, защото нощта е безкрайна, и под звездите и затрупаните покриви бродят още много тайни из дворищата, под сайвантите и в затоплените обори и на пруста, дето виси кожата на закланото прасе, опъната като географска карта.

Наближава Коледа. Цяла седмица квичаха прасетата, клаха ги и окървавиха белия сняг, а после ядоха пържоли въпреки постите и ги поливаха с новото вино. Напълниха догоре дървените качета със свинско месо и сланина, стопиха маста и опушиха бутовете. Всичко беше завещано и благословено от деди и прадеди и носеше утеха за цялата зима. Дори и децата бяха щастливи, защото им даваха мехура на прасето да играят с него на топка.

Припомням си всичко това, когато ме питате как се оформя и изгражда мирогледът на човека кои са ония сили, които сочат правите пътища на подрастващия… И кой е онзи добър градинар, който, насажда благородните помисли и добрите чувства в детската душа? Слушам тия въпроси и непрекъснато се пренасям към изворите на миналото. Те клокочат и шумят и поддържат с животворната си мъдрост не само мене, селското момче, но и милионите като мене… Припомням си този сложен и многообразен човешки свят, за да намеря истината и за себе си, и за вас. И ако в равносметката си направя погрешни изводи или неправилна стъпка, простете, вината е моя, а не на живота, за който ви разказвам. Ще се стремя да говоря истината, доколкото позволяват силите ми, и ще бъда много щастлив, ако успея да задоволя чистосърдечната ви любознателност.

 

 

Започнах с декемврийската нощ.

Бил съм може би на десет години. Зимните вечери настъпваха много рано и време за игра почти не ни оставаше. Пък и такъв беше обичаят на жените — щом се здрачи, започваха да ни прибират с викове и крясъци от улицата, дето се пързаляхме и биехме със снежни топки.

— Петре, Петре бре! — чувах гласа на мама. — Още ли си там?

Изморен, задъхан, изпотен и мокър от снега, пристигах, направо в задимената одаичка, дето всички бяха вече насядали около кръглата паралия.

Дънерите в камината догаряха. Котката мъркаше, сложила лапите си върху топлата пепел, обърнала гърба си към жаравата. Около софрата са насядали и коленичили направо върху пръстения под, застлан с изгнила рогозка, всички от фамилията. Фамилията ни е от времето на матриархата. Всички са жени — майка ми, баба ми (най-свадливата, която всички в село наричат баба Дена Политиканката), двете ми сестри, едната, както вече казах, много сладкодумна и по-голяма от мене с пет години, другата — моя близначка, казват, че аз съм бил по-стар, защото, когато сме се раждали, аз съм се появил по-напред от нея на белия свят. Това ми е много чудно, ала от известно време не разпитвам нищо по този въпрос. До близначката седеше, подгънала колене, жената на брат ми, най-големия, който работеше в една мелница някъде из Делиормана. Младата булка беше синеока, бяла и червена, с напукани пети и корави ръце (тя ореше и засяваше нивите). Имаше дълги, сплетени на две руси плитки, с които не знам защо се гордееше баба ми. Спомням си, когато придумваше на времето брат ми да се ожени за тая русокоса мома, баба най-много говореше за двете дълги и дебели плитки, които приличали на „два зъма“ и стигали чак до петите й. Брат ми слушаше внимателно това и се ожени твърде скоро за хубавицата с „двата зъма“.

Влязох в одаята и седнах до близначката. Всички сърбаха мълчаливо от една дълбока пръстена паница. В нея се въртяха няколко бобени зърна и надробени люти чушки. Това възбуждаше глада и дървените лъжици се блъскаха и потракваха припряно и неспокойно над задимената пръстена съдина. За мене нямаше лъжица и аз трябваше да ям с лъжицата на близначката. Тя беше кротко и отстъпчиво момиче — сръбне веднъж, после даде и на мене и аз да сръбна. Това се наричаше не знам защо „кашикане“. В нашата многобройна фамилия много често се „кашикахме“, защото лъжиците все не достигаха.

Освен големия брат, който скиташе из мелниците на Делиормана, от софрата липсваше още един човек, за когото никой нищо не споменаваше, но чийто образ непрекъснато се мяркаше в ума ни. И всеки си мислеше за него посвоему. Този човек беше брат ми, гимназистът, заминал за София да следва в Художествената академия. Той рисуваше хубаво и искаше да стане художник, макар никой от нас да не разбираше какво точно може да означава тази неясна професия. Той замина съвсем неочаквано, без да пита никого, и няколко месеца подред не се обаждаше. Това ни безпокоеше, но никой от нас не знаеше къде да се обърне и кого да попита за изчезналия художник.

Липсваше и баща ми, загинал на фронта в Македония още през 1918 година. С неговата смърт ние отдавна се бяхме помирили. Само майка ми често си поплакваше, застанала до каменната ограда и загледана нагоре, по белия път, който водеше към Балкана. „Случвало се е да се връщат!“ — казваше тя и сълзите й застиваха върху почернелите й, изгорели от слънцето бузи, набръчкани преждевременно като повехнала ябълка. Ала той не се върна… И аз останах сам, единственият мъж в това женско царство. При това — съвсем непослушен, палав и понякога много зъл, когато се опитат да ми опънат ухото или не дай боже да ми ударят плесница. Тогава почервенявах и от очите ми хвърчаха светкавици.

Вечерята трая няколко минути — докато изсърбаме боба от пръстената паница. След това ни сипаха варени сливи, за „подслаждане“, и на края ни прибраха в собата да спим.

Тъй вървеше нашият живот и животът на съседите и на всички хора от селото ни. Ние дори не подозирахме колко сме бедни. За нас беше естествено да си светим вечер с огъня от камината, да палим понякога опушеното газениче и съвсем рядко да си служим с газената лампа с вечно нащърбеното „шише“. Ядяхме бързо, като че ли хвърляхме залъците зад гърба си, „надве-натри“, както казваше майка ми, и никога това не беше най-важното в живота ни, макар да не си дояждахме и „голите ни тумбаци“ никога да не се насищаха. Можеш ли да нахраниш сиромаха? Той вечно е гладен! А всъщност какво му трябваше: комат хляб, парче сланина, поръсена с червен пипер, и едно местенце, дето да свре главата си, за да се наспи.

Тия уморени хора!

Само ние децата не мирясвахме, не обичахме да спим. Така много ни привличаха игрите, забавленията! Особено вечер! И сега дори, толкова години след това, аз си спомням декемврийската вечер със звездите, с месеца и белия сняг. Може би поетичната магия на детските години отново пламти с цветовете на радостта пред очите ми, които вече стареят и бавно угасват? Или нещо друго се е случило?

Стоях до прозорчетата. Те бяха две, зарешетени с дълги железни пръчки, за да не паднем, когато гледаме навън. Една част от стъклото беше счупена и на нейно място жените бяха залепили парче вестник с прясно тесто. Аз още не бях успял да пъхна пръста си през хартията и това много ме съблазняваше. Дълго барабаних по опънатата хартия и благоразумието ми надделя. Хванах се за железните пръчки, допрях носа си до студеното заледено стъкло и отново се загледах към звездите. Такава нощ наистина никога не бях виждал. Коминът и месецът продължаваха да разговарят, сенките си стояха по местата, пързалката лъщеше като огледало, по заледената пъртина припкаха кучетата от махалата. Къде ли ходят, защо ли скитат, какво ли търсят? Започвам да им свиркам, но те не ме чуват и са спокойни. Изчезват в сенките, губят се из дворищата и пак се появяват. Нощем живот, кучешки живот. Аз им завиждам. Иска ми се като тях да ходя по пъртината под грейналата месечина и да се скитам, където си искам из дворищата, дето няма никакви хора.

Селото вече спи. Или може би се готви да спи. Или се преструва, че спи. Все едно. Тишина, тишина. Звездите се отдалечават, като че ли текат нанякъде като огнен порой. Аз съм зашеметен. Преставам да ги гледам и се обръщам към силуетите на хоризонта. Там е гората, до нея — хълмът с лозята, а по-нататък — угарите и засетите пшеничени ниви. Там някъде е и нашата нива. Есенес аз водих воловете, а буля с „двата зъма“ ореше боса, с напукани пети, изгоряла от слънцето, сърдита. След много-много години на една изложба видях картина — сред угарите селянка кърми детето си, зад нея се виждат ралото и двата вола… Жената е уморена, тъжна и малко замечтана. Какво ли мисли? Може би чака мъжа си или края на теглото? Селски жени! Вие носите всичко на двете си ръце — и ралото, и децата, и надеждите си. А хубостта ви изгаря по угарите и стърнищата, като че ли никога не е съществувала!

Стискам здраво железните пръчки на прозорчето и не откъсвам погледа си от хълма. Сега той е покрит с дебел сняг, а под снега се гуши на топло поникналото жито. Отгоре, върху заледената снежна коричка, се гонят зайците, огрени от месечината. А от близката гора ги гледа сивият вълк и потраква със зъбите си. Очите му са червени като разпалени главни. Той е гладен. А зайците не знаят и продължават да се изправят на задните си крака и да се прескачат. Вълкът обмисля как да ги нападне. Аз знам, че той е решил да схруска с железните си челюсти най-малкия, който скача най-високо. Вълкът се ядосва на този хвалипръцко и още по-силно трака със зъбите си. Ала зайците не го чуват, увлечени в играта си под месечината. Но какво става там? Зайците изчезват. Вълкът върви сам през заснежената нива, спира се и понеже не може да извие врата си, обръща цялото си тяло и дълго гледа към селото. Може би той вижда нашия прозорец? Или чува звънчето на козата, която спи долу в обора при воловете и чака да се окози? Всичко усеща и разбира този разбойник. Аз стискам още по-силно железата и по кожата ми лазят тръпки от страх. Вълкът изчезва и на огрения от месечината хълм настъпва предишното затишие. Аз постепенно се успокоявам и започвам да мисля за имането, което е скрито в нашата нива между двата стогодишни дъба. Баба ми разправяше, че го виждала понякога нощем да играе. Не ми се е случвало да видя тая игра. Само баба беше ощастливена, и то не за друго, а защото се будеше нощем от задуха си и не можеше да заспи, измъчвана от кашлицата. Разбира се, в такива часове на нощната доба тя виждаше пламъците на имането как се вият към небето. Изскочат от земята като змии пепелянки, огреят околността и пак се скрият. До три пъти. А понякога и повече, ако жълтиците са повече. Ако ли пък е заровен един казан или няколко делви с махмудии, тогава пламъците се вият чак до върховете на двата дъба и могат да ослепят човека.

— Тази нощ ще умре най-хубавата циганка! — извика някой зад гърба ми. Обърнах се. До мене стоеше сестра ми, сладкодумницата, която измисляше винаги страшни неща. Защо пък най-хубавата циганка? Така говореха нашите селяни, когато свиеха големите декемврийски студове. Може би с това искаха да кажат колко е жестока и люта зимата?

— Каква месечина е огряла — продължи сестра ми, като се наведе до мене и прилепи лицето си на прозореца, — да тръгнеш, че да се не върнеш!

— Какво каза?

— Да тръгнеш, че да се не върнеш!

— Защо да се не върнеш?

Аз си представих дълъг, бял път, огрян от месечината. Вървя по него и не мисля вече да се връщам в село… Колко хубаво! Дълъг път, месечината и аз самичък… вървя, ставам малък като точица и се загубвам в мъглата. И никой не знае къде съм отишъл!

— Да тръгнеш, че да се не върнеш!

Обичах да я слушам тази приказливка. Тя все измисляше нещо особено. Нали тя ме слагаше в кофата, с която вадеха вода от кладенеца и ме спущаше, за да изпита здравината на въжето? Нали тя ме караше да стъпвам на раменете й и да ме носи по стръмната пътека из дворищата и по скалите? Смело момиче! Как само я зовеше месечината: „Да тръгнеш, че да се не върнеш!“. Обичах да я слушам. И още повече за това, че откак изчезна брат ми, тя зае мястото му и започна да ни чете от книгата, която стоеше скрита в дървения долап.

— Ще четем ли? — запита тя, като се обърна и огледа полутъмната стаичка. — Трябва да изчистя шишето на лампата, че баба пак ще ми се скара… Донеси кълчища от килера!

— Страх ме е.

— Страх ли те е? Че защо?

— Миналата нощ баба срещнала закланото прасе да излиза из килера.

— Вярно. И аз го срещнах. Вампирясало. Беше се измъкнало от качето със саламурата… Вървеше на задните си крака и ушите му стърчаха.

Аз я гледах вцепенен, по-блед и от месечината.

Тя продължи:

— Слезе на двора и отиде до кочината, дето го бяха заклали. Помириса нещо и се озъби. Подир тръгна към хармана. Там имаше един човек, сигурно хайдутин е бил…

— Хайдутин?

— Може и да не е бил хайдутин… Не видях добре… Може да е бил пък Ристо кривогледия… Прасето върви към него, а той се бута под сайванта към плевнята. Мъчи се да отвори вратата, за да се скрие в плевнята, ама вратата не се отваря. А прасето върви към него на два крака и се зъби, като че ли се смее. Ристо разпери ръцете си да го отпъди и взе да вика, ама глас не се чува? Подир се обърна и прасето се покачи на раменете му и го подкара към Синия вир…

— Към Синия вир?

— Да го удави, задето го заклал.

— Ристо ли го е заклал?

— Ристо. Той коли всички прасета в село… Кривоглед е, а знае къде да мушне с ножа… Прасетата хъркат малко и не квичат. Умее Ристо да коли прасета, не ги мъчи, ама ей на, пак го мразят… И нощем го яздят!…

— После?

— После… Тръгнаха към Синия вир… Не щеш ли, петелът пропя и прасето скочи и търти назад към килера. А Ристо си отвори пазвата и взе да плюе вътре, за да му мине страхът.

Тя млъкна, загледана усмихнато в мене:

— Ще идем ли в килера за кълчища? Трябва да изчистя лампеното шише. Не щеш ли? Аз пък ще ида! Гледай! Не ме е страх!

Тя се насочи към вратата, излезе. Аз стоях вцепенен и чувах как ми тракат зъбите.

— Чуваш ли? — вика тя отвън.

„Чувам!“ — опитвам се да й отговоря, ала не мога, гласът ми е изчезнал и това още повече ме ужасява.

— Чуваш ли? — вика тя от килера. — Взех кълчищата!… Сега слагам ръката си на качето със сланината!… Чуваш ли?… Сега пипам опушения бут… Чуваш ли?…

Тя се връща и се хили — зъбите й греят в тъмното, очите й светят. Тя е магьосница. Не смея да се поместя от прозореца. Струва ми се, че подире й върви прасето, изправено на задните си крака. Боже мой! Тя махва и прасето изчезва. В ръката й се развява повесмо кълчища, тя го намотава на едно вретено и с него изчиства опушеното лампено шише. След това запалва фитила на лампата и в собата светва, страшните привидения изчезват. Сестра ми чевръсто се разхожда насам-натам, рови за нещо из долапа, търси дебелата книга с червените корици, останала още от баща ми, и ми говори нещо, ала аз не я чувам. В това време отдолу пристигат в собата и останалите жени. Пристига баба заедно с близначката — близначката не се откъсва от полата й. Последни идват мама и буля с „двама зъма“. Те са ходили да нагледат воловете, проверили са дали е залостен курникът, надникнали са под сайванта, дето спи в сеното старото ни куче, което навярно ще умре тази зима. Много грижи имат вечер селските жени! Проверили са раклата с брашното, заключили са я! Нощем бродят крадци, брашното трябва да се пази, докато излезе копривата напролет!

И ето цялата фамилия отново се събра в малката соба. Аз се хващам за гредата и се люлея. Близначката също иска да се люлее. Аз не й позволявам и тя кротко се свива в скута на баба. Старицата пресяга с хурката си и ме перва по краката:

— Стига си се люлял!… Дигаш само прахоляка!… Мирясай!

Аз продължавам да се люлея напук на всички. Старицата кашля, души я астмата, ала не позволява да се отвори прозорецът, за да не излезе топлото. Мама ме изглежда и аз скачам на сламеника. Сядам близо до лампата и се укротявам. Жените също се нареждат по дървения одър. Той заема почти цялата стая. На него спим всички, като се нареждаме от единия до другия край и се завиваме с един общ губер. Аз спя до мама, на края, и до мене почти никога не стига губерът.

Още е рано за спане. Нощта е голяма. Трябва да се свърши някоя работа. Буля преде, мама кърпи моята риза, баба продължава да кашля и пие от зелената стомна вода, за да й мине. Минава й. Всичко утихва. Тогава сестра ми, приятелката на караконджовците и на вампирите, измъква от долапа дебелата книга и сяда близо до лампата, за да вижда по-добре. Ние съсредоточаваме погледите си към нея. Чакаме с нетърпение. Сестра ми бавно разтваря книгата, страниците шумолят между чевръстите й пръсти. Тя знае точно докъде сме стигнали миналата вечер.

Навежда се над книгата и започва да чете, като че ли пее. Ние слушаме внимателно. Само вретеното бръмчи.

— „… Марко се понамръщи — чете сладкодумницата, — но не отговори нищо. Трябва да забележим, че Асенча го беше втресло днес, защото из прозорците на училището беше видял трупа на обезглавеното дете на Генча Бояджията, що бяха докарали от полето в черковния двор. Марко прибърза да промени разговора и се обърна към децата:

— Сега мирувайте, да чуем бачо ви какво ще ни разкаже. И после всички ще изпеете една песен. Василе, я разправи днес какво ви предава учителят!

— Урок по всеобща история.

— Добре, разкажи ни от историята: кое беше?

— Война за наследството на испанския престол.

— За шпаньолците ли? Остави ги, те не ни влизат в работата. Кажи нещо за Русия.

— Кое? — попита Васил.

— Например за Ивана Грозния, за Бонапарта, кога запалил Москва.“

Сестра ми неочаквано спря четенето, беше загубила реда.

— Притъмня ми на очите — рече тя и се приближи още повече до лампата. Гледахме я напрегнато и малко недоволно, че спира на най-важното място. Беше тихо. Дори вретеното не бръмчеше.

— Чети де — извика най-подир баба, — или пък дай на Петра да продължи!… Кокошничава ли си?

Сестра ми намери загубения ред и ми подаде книгата:

— Карай оттук, че на мене ми тъмне. — И тя се отдръпна настрана, близо до вратата, и прихлупи очите си с двете си шепи.

— „… Марко не довърши думата си — продължих да сричам аз. — Изрухтя нещо в тъмното дъно на двора; керемиди паднаха с трясък от стряхата на зида. Кокошките и пилците изкудкудякаха уплашени и се разхвърчаха насам с настръхнал перушиняк. Слугинята, която събираше там прострените ризи, изпищя и завика: «Хайдути! Хайдути!».

В двора настана страшна смутня. Жените се изпокриха из стаите, децата се не чуха, не видяха, а Марко, който беше храбър, прав, след като надникна в тъмното място, отдето дойде шумът, изчезна в една врата. Подир малко излезе из друга, при обора. Той държеше два пищова…“

Аз продължавах да сричам, а жените ме гледаха, спрели работата си. Само сестра ми стоеше с прихлупено в шепите си лице и не помръдваше. Тя бързо се отегчаваше от четенето и винаги си измисляше, че я болят очите, за да пъхне книгата в ръцете ми. Хитруша, знам я аз! Тя сега се преструва на умряла лисица и си мисли за своите магьоснически работи. Ала ние сме увлечени от магията на дебелата книга:

— „… Марко влезе на пръсти в обора — продължавах аз с висок глас, за да заглуша страха си, който все повече ме обхващаше, — като погали коня по задницата, да се не плаши и погледна през дървените пресечки на прозорчето. Било че окото му привикна на мрака, било че тъй му се стори, той видя в ъгъла, до самото прозорче, нещо изправено, като човек, и съвършено неподвижно…“

Сестра ми откри лицето си и се надигна.

— Чакай! — извика тя, като простря ръката си към мене.";
            string[] numbersAsArray = input.Split();

            // 4 5 3 2,5 3,8 4 5 5 4 4 4
            for (int i = 0; i < numbersAsArray.Length; i++)
            {
                if (!numbersDict.ContainsKey(numbersAsArray[i]))
                {
                    numbersDict.Add(numbersAsArray[i], 0);
                }

                numbersDict[numbersAsArray[i]]++;
            }


            // Sort Value

            numbersDict = numbersDict
                .OrderByDescending(p => p.Value)
                .ThenByDescending(p=> p.Key)
                .ToDictionary(p => p.Key, p => p.Value);

            foreach (var item in numbersDict)
            {
                Console.WriteLine($"{item.Key} -> {item.Value}");
            }
        }
    }
}
